----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Work\QPS\Closed Charts\Programming\STATA\Closed Charts Analysis - Outputs\A&E.log
  log type:  text
 opened on:  23 Jan 2021, 19:41:14

. 
. drop if DOCUMENTED == "NA"
(142 observations deleted)

. 
. ///gen MET = .
> ///replace MET = 1 if (DOCUMENTED == "D" & TIMELY == "Y" & LEGIBLE == "Y" & COMPLETE == "Y")
> ///replace MET = 2 if (DOCUMENTED == "ND" | TIMELY == "N" | LEGIBLE == "N" | COMPLETE == "N")
> *replace MET = 2 if MET == . ///An alternative, adds an increment of 1, don't use!
> 
. ///label define met 1 "MET" 2 "NOT MET"
> ///label val MET met
> 
. gen MET = "M" if (DOCUMENTED == "D" & TIMELY == "Y" & LEGIBLE == "Y" & COMPLETE == "Y")
(107 missing values generated)

. replace MET = "NM" if (DOCUMENTED == "ND" | TIMELY == "N" | LEGIBLE == "N" | COMPLETE == "N")
variable MET was str1 now str2
(106 real changes made)

. 
. 
. ////Departmental Results
> //Overall percentages
. tab DOCUMENTED

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |        273       91.92       91.92
         ND |         24        8.08      100.00
------------+-----------------------------------
      Total |        297      100.00

. tab TIMELY if DOCUMENTED == "D"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |          2        0.73        0.73
          Y |        271       99.27      100.00
------------+-----------------------------------
      Total |        273      100.00

. tab LEGIBLE if DOCUMENTED == "D"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         59       21.61       21.61
          Y |        214       78.39      100.00
------------+-----------------------------------
      Total |        273      100.00

. tab COMPLETE if DOCUMENTED == "D"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         28       10.26       10.26
          Y |        245       89.74      100.00
------------+-----------------------------------
      Total |        273      100.00

. tab MET

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |        191       64.31       64.31
         NM |        106       35.69      100.00
------------+-----------------------------------
      Total |        297      100.00

. 
. //Percentages per document for each Statistic
. tab DOCUMENTS DOCUMENTED, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |      DOCUMENTED
            DOCUMENTS |         D         ND |     Total
----------------------+----------------------+----------
Appropriate pain as.. |        41          3 |        44 
                      |     93.18       6.82 |    100.00 
----------------------+----------------------+----------
Check the Discharge.. |        21          0 |        21 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |        26          7 |        33 
                      |     78.79      21.21 |    100.00 
----------------------+----------------------+----------
Discharge/Transfer/.. |        21          4 |        25 
                      |     84.00      16.00 |    100.00 
----------------------+----------------------+----------
Fall Risk Assessmen.. |        40          4 |        44 
                      |     90.91       9.09 |    100.00 
----------------------+----------------------+----------
Nursing Initial Ass.. |        41          3 |        44 
                      |     93.18       6.82 |    100.00 
----------------------+----------------------+----------
Nursing Re-Assessme.. |        41          3 |        44 
                      |     93.18       6.82 |    100.00 
----------------------+----------------------+----------
Physician Initial A.. |        42          0 |        42 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
                Total |       273         24 |       297 
                      |     91.92       8.08 |    100.00 


. tab DOCUMENTS TIMELY if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        TIMELY
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Appropriate pain as.. |         0         41 |        41 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Check the Discharge.. |         0         21 |        21 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         1         25 |        26 
                      |      3.85      96.15 |    100.00 
----------------------+----------------------+----------
Discharge/Transfer/.. |         0         21 |        21 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Fall Risk Assessmen.. |         1         39 |        40 
                      |      2.50      97.50 |    100.00 
----------------------+----------------------+----------
Nursing Initial Ass.. |         0         41 |        41 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Nursing Re-Assessme.. |         0         41 |        41 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Physician Initial A.. |         0         42 |        42 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
                Total |         2        271 |       273 
                      |      0.73      99.27 |    100.00 


. tab DOCUMENTS LEGIBLE if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Appropriate pain as.. |         1         40 |        41 
                      |      2.44      97.56 |    100.00 
----------------------+----------------------+----------
Check the Discharge.. |         7         14 |        21 
                      |     33.33      66.67 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         2         24 |        26 
                      |      7.69      92.31 |    100.00 
----------------------+----------------------+----------
Discharge/Transfer/.. |         8         13 |        21 
                      |     38.10      61.90 |    100.00 
----------------------+----------------------+----------
Fall Risk Assessmen.. |         7         33 |        40 
                      |     17.50      82.50 |    100.00 
----------------------+----------------------+----------
Nursing Initial Ass.. |        24         17 |        41 
                      |     58.54      41.46 |    100.00 
----------------------+----------------------+----------
Nursing Re-Assessme.. |         5         36 |        41 
                      |     12.20      87.80 |    100.00 
----------------------+----------------------+----------
Physician Initial A.. |         5         37 |        42 
                      |     11.90      88.10 |    100.00 
----------------------+----------------------+----------
                Total |        59        214 |       273 
                      |     21.61      78.39 |    100.00 


. tab DOCUMENTS COMPLETE if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |       COMPLETE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Appropriate pain as.. |         2         39 |        41 
                      |      4.88      95.12 |    100.00 
----------------------+----------------------+----------
Check the Discharge.. |         1         20 |        21 
                      |      4.76      95.24 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         2         24 |        26 
                      |      7.69      92.31 |    100.00 
----------------------+----------------------+----------
Discharge/Transfer/.. |         6         15 |        21 
                      |     28.57      71.43 |    100.00 
----------------------+----------------------+----------
Fall Risk Assessmen.. |         1         39 |        40 
                      |      2.50      97.50 |    100.00 
----------------------+----------------------+----------
Nursing Initial Ass.. |         8         33 |        41 
                      |     19.51      80.49 |    100.00 
----------------------+----------------------+----------
Nursing Re-Assessme.. |         5         36 |        41 
                      |     12.20      87.80 |    100.00 
----------------------+----------------------+----------
Physician Initial A.. |         3         39 |        42 
                      |      7.14      92.86 |    100.00 
----------------------+----------------------+----------
                Total |        28        245 |       273 
                      |     10.26      89.74 |    100.00 


. tab DOCUMENTS MET, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
            DOCUMENTS |         M         NM |     Total
----------------------+----------------------+----------
Appropriate pain as.. |        38          6 |        44 
                      |     86.36      13.64 |    100.00 
----------------------+----------------------+----------
Check the Discharge.. |        14          7 |        21 
                      |     66.67      33.33 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |        21         12 |        33 
                      |     63.64      36.36 |    100.00 
----------------------+----------------------+----------
Discharge/Transfer/.. |         8         17 |        25 
                      |     32.00      68.00 |    100.00 
----------------------+----------------------+----------
Fall Risk Assessmen.. |        31         13 |        44 
                      |     70.45      29.55 |    100.00 
----------------------+----------------------+----------
Nursing Initial Ass.. |        13         31 |        44 
                      |     29.55      70.45 |    100.00 
----------------------+----------------------+----------
Nursing Re-Assessme.. |        31         13 |        44 
                      |     70.45      29.55 |    100.00 
----------------------+----------------------+----------
Physician Initial A.. |        35          7 |        42 
                      |     83.33      16.67 |    100.00 
----------------------+----------------------+----------
                Total |       191        106 |       297 
                      |     64.31      35.69 |    100.00 


. 
. 
. 
. ////Group summaries
> ///Physicians
> //Overall
. tab DOCUMENTED if TYPE == "P"

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |         84       95.45       95.45
         ND |          4        4.55      100.00
------------+-----------------------------------
      Total |         88      100.00

. tab TIMELY if TYPE == "P" & DOCUMENTED == "D"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          Y |         84      100.00      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab LEGIBLE if TYPE == "P" & DOCUMENTED == "D"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         20       23.81       23.81
          Y |         64       76.19      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab COMPLETE if TYPE == "P" & DOCUMENTED == "D"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         10       11.90       11.90
          Y |         74       88.10      100.00
------------+-----------------------------------
      Total |         84      100.00

. tab MET if TYPE == "P"

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |         57       64.77       64.77
         NM |         31       35.23      100.00
------------+-----------------------------------
      Total |         88      100.00

. 
. //Physician documents
. tab DOCUMENTS DOCUMENTED if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |      DOCUMENTED
            DOCUMENTS |         D         ND |     Total
----------------------+----------------------+----------
Check the Discharge.. |        21          0 |        21 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
Discharge/Transfer/.. |        21          4 |        25 
                      |     84.00      16.00 |    100.00 
----------------------+----------------------+----------
Physician Initial A.. |        42          0 |        42 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
                Total |        84          4 |        88 
                      |     95.45       4.55 |    100.00 


. tab DOCUMENTS TIMELY if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |   TIMELY
            DOCUMENTS |         Y |     Total
----------------------+-----------+----------
Check the Discharge.. |        21 |        21 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Discharge/Transfer/.. |        21 |        21 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Physician Initial A.. |        42 |        42 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |        84 |        84 
                      |    100.00 |    100.00 


. tab DOCUMENTS LEGIBLE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check the Discharge.. |         7         14 |        21 
                      |     33.33      66.67 |    100.00 
----------------------+----------------------+----------
Discharge/Transfer/.. |         8         13 |        21 
                      |     38.10      61.90 |    100.00 
----------------------+----------------------+----------
Physician Initial A.. |         5         37 |        42 
                      |     11.90      88.10 |    100.00 
----------------------+----------------------+----------
                Total |        20         64 |        84 
                      |     23.81      76.19 |    100.00 


. tab DOCUMENTS COMPLETE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |       COMPLETE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check the Discharge.. |         1         20 |        21 
                      |      4.76      95.24 |    100.00 
----------------------+----------------------+----------
Discharge/Transfer/.. |         6         15 |        21 
                      |     28.57      71.43 |    100.00 
----------------------+----------------------+----------
Physician Initial A.. |         3         39 |        42 
                      |      7.14      92.86 |    100.00 
----------------------+----------------------+----------
                Total |        10         74 |        84 
                      |     11.90      88.10 |    100.00 


. tab DOCUMENTS MET if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
            DOCUMENTS |         M         NM |     Total
----------------------+----------------------+----------
Check the Discharge.. |        14          7 |        21 
                      |     66.67      33.33 |    100.00 
----------------------+----------------------+----------
Discharge/Transfer/.. |         8         17 |        25 
                      |     32.00      68.00 |    100.00 
----------------------+----------------------+----------
Physician Initial A.. |        35          7 |        42 
                      |     83.33      16.67 |    100.00 
----------------------+----------------------+----------
                Total |        57         31 |        88 
                      |     64.77      35.23 |    100.00 


. 
. //Per Physician
. tab DOCTOR DOCUMENTED if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                 |      DOCUMENTED
          DOCTOR |         D         ND |     Total
-----------------+----------------------+----------
   Hussein Manji |         3          0 |         3 
                 |    100.00       0.00 |    100.00 
-----------------+----------------------+----------
    Kilalo Mjema |        30          0 |        30 
                 |    100.00       0.00 |    100.00 
-----------------+----------------------+----------
  Muhanuzi Biita |        13          2 |        15 
                 |     86.67      13.33 |    100.00 
-----------------+----------------------+----------
  Renatus Tarimo |         7          1 |         8 
                 |     87.50      12.50 |    100.00 
-----------------+----------------------+----------
   Shaffin Rajan |         7          0 |         7 
                 |    100.00       0.00 |    100.00 
-----------------+----------------------+----------
Sherin Kassamali |        21          1 |        22 
                 |     95.45       4.55 |    100.00 
-----------------+----------------------+----------
           Total |        81          4 |        85 
                 |     95.29       4.71 |    100.00 


. tab DOCTOR TIMELY if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                 |   TIMELY
          DOCTOR |         Y |     Total
-----------------+-----------+----------
   Hussein Manji |         3 |         3 
                 |    100.00 |    100.00 
-----------------+-----------+----------
    Kilalo Mjema |        30 |        30 
                 |    100.00 |    100.00 
-----------------+-----------+----------
  Muhanuzi Biita |        13 |        13 
                 |    100.00 |    100.00 
-----------------+-----------+----------
  Renatus Tarimo |         7 |         7 
                 |    100.00 |    100.00 
-----------------+-----------+----------
   Shaffin Rajan |         7 |         7 
                 |    100.00 |    100.00 
-----------------+-----------+----------
Sherin Kassamali |        21 |        21 
                 |    100.00 |    100.00 
-----------------+-----------+----------
           Total |        81 |        81 
                 |    100.00 |    100.00 


. tab DOCTOR LEGIBLE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                 |        LEGIBLE
          DOCTOR |         N          Y |     Total
-----------------+----------------------+----------
   Hussein Manji |         0          3 |         3 
                 |      0.00     100.00 |    100.00 
-----------------+----------------------+----------
    Kilalo Mjema |        11         19 |        30 
                 |     36.67      63.33 |    100.00 
-----------------+----------------------+----------
  Muhanuzi Biita |         0         13 |        13 
                 |      0.00     100.00 |    100.00 
-----------------+----------------------+----------
  Renatus Tarimo |         1          6 |         7 
                 |     14.29      85.71 |    100.00 
-----------------+----------------------+----------
   Shaffin Rajan |         0          7 |         7 
                 |      0.00     100.00 |    100.00 
-----------------+----------------------+----------
Sherin Kassamali |         6         15 |        21 
                 |     28.57      71.43 |    100.00 
-----------------+----------------------+----------
           Total |        18         63 |        81 
                 |     22.22      77.78 |    100.00 


. tab DOCTOR COMPLETE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                 |       COMPLETE
          DOCTOR |         N          Y |     Total
-----------------+----------------------+----------
   Hussein Manji |         0          3 |         3 
                 |      0.00     100.00 |    100.00 
-----------------+----------------------+----------
    Kilalo Mjema |         3         27 |        30 
                 |     10.00      90.00 |    100.00 
-----------------+----------------------+----------
  Muhanuzi Biita |         2         11 |        13 
                 |     15.38      84.62 |    100.00 
-----------------+----------------------+----------
  Renatus Tarimo |         2          5 |         7 
                 |     28.57      71.43 |    100.00 
-----------------+----------------------+----------
   Shaffin Rajan |         0          7 |         7 
                 |      0.00     100.00 |    100.00 
-----------------+----------------------+----------
Sherin Kassamali |         3         18 |        21 
                 |     14.29      85.71 |    100.00 
-----------------+----------------------+----------
           Total |        10         71 |        81 
                 |     12.35      87.65 |    100.00 


. tab DOCTOR MET if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                 |          MET
          DOCTOR |         M         NM |     Total
-----------------+----------------------+----------
   Hussein Manji |         3          0 |         3 
                 |    100.00       0.00 |    100.00 
-----------------+----------------------+----------
    Kilalo Mjema |        18         12 |        30 
                 |     60.00      40.00 |    100.00 
-----------------+----------------------+----------
  Muhanuzi Biita |        11          4 |        15 
                 |     73.33      26.67 |    100.00 
-----------------+----------------------+----------
  Renatus Tarimo |         5          3 |         8 
                 |     62.50      37.50 |    100.00 
-----------------+----------------------+----------
   Shaffin Rajan |         7          0 |         7 
                 |    100.00       0.00 |    100.00 
-----------------+----------------------+----------
Sherin Kassamali |        12         10 |        22 
                 |     54.55      45.45 |    100.00 
-----------------+----------------------+----------
           Total |        56         29 |        85 
                 |     65.88      34.12 |    100.00 


. 
. ///Per RMO
> tab RMO DOCUMENTED if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                 |      DOCUMENTED
             RMO |         D         ND |     Total
-----------------+----------------------+----------
  Elishah Premji |         2          0 |         2 
                 |    100.00       0.00 |    100.00 
-----------------+----------------------+----------
      Frank Swai |         4          2 |         6 
                 |     66.67      33.33 |    100.00 
-----------------+----------------------+----------
   Hussein Manji |         8          0 |         8 
                 |    100.00       0.00 |    100.00 
-----------------+----------------------+----------
       Reinfrida |        17          1 |        18 
                 |     94.44       5.56 |    100.00 
-----------------+----------------------+----------
Richard Mashauri |         6          0 |         6 
                 |    100.00       0.00 |    100.00 
-----------------+----------------------+----------
 Sumayyah Saudin |        13          0 |        13 
                 |    100.00       0.00 |    100.00 
-----------------+----------------------+----------
     Wafaa Razak |         9          0 |         9 
                 |    100.00       0.00 |    100.00 
-----------------+----------------------+----------
    Waziri Gahhu |        16          1 |        17 
                 |     94.12       5.88 |    100.00 
-----------------+----------------------+----------
           Total |        75          4 |        79 
                 |     94.94       5.06 |    100.00 


. tab RMO TIMELY if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                 |   TIMELY
             RMO |         Y |     Total
-----------------+-----------+----------
  Elishah Premji |         2 |         2 
                 |    100.00 |    100.00 
-----------------+-----------+----------
      Frank Swai |         4 |         4 
                 |    100.00 |    100.00 
-----------------+-----------+----------
   Hussein Manji |         8 |         8 
                 |    100.00 |    100.00 
-----------------+-----------+----------
       Reinfrida |        17 |        17 
                 |    100.00 |    100.00 
-----------------+-----------+----------
Richard Mashauri |         6 |         6 
                 |    100.00 |    100.00 
-----------------+-----------+----------
 Sumayyah Saudin |        13 |        13 
                 |    100.00 |    100.00 
-----------------+-----------+----------
     Wafaa Razak |         9 |         9 
                 |    100.00 |    100.00 
-----------------+-----------+----------
    Waziri Gahhu |        16 |        16 
                 |    100.00 |    100.00 
-----------------+-----------+----------
           Total |        75 |        75 
                 |    100.00 |    100.00 


. tab RMO LEGIBLE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                 |        LEGIBLE
             RMO |         N          Y |     Total
-----------------+----------------------+----------
  Elishah Premji |         2          0 |         2 
                 |    100.00       0.00 |    100.00 
-----------------+----------------------+----------
      Frank Swai |         0          4 |         4 
                 |      0.00     100.00 |    100.00 
-----------------+----------------------+----------
   Hussein Manji |         4          4 |         8 
                 |     50.00      50.00 |    100.00 
-----------------+----------------------+----------
       Reinfrida |         4         13 |        17 
                 |     23.53      76.47 |    100.00 
-----------------+----------------------+----------
Richard Mashauri |         5          1 |         6 
                 |     83.33      16.67 |    100.00 
-----------------+----------------------+----------
 Sumayyah Saudin |         1         12 |        13 
                 |      7.69      92.31 |    100.00 
-----------------+----------------------+----------
     Wafaa Razak |         0          9 |         9 
                 |      0.00     100.00 |    100.00 
-----------------+----------------------+----------
    Waziri Gahhu |         0         16 |        16 
                 |      0.00     100.00 |    100.00 
-----------------+----------------------+----------
           Total |        16         59 |        75 
                 |     21.33      78.67 |    100.00 


. tab RMO COMPLETE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                 |       COMPLETE
             RMO |         N          Y |     Total
-----------------+----------------------+----------
  Elishah Premji |         0          2 |         2 
                 |      0.00     100.00 |    100.00 
-----------------+----------------------+----------
      Frank Swai |         1          3 |         4 
                 |     25.00      75.00 |    100.00 
-----------------+----------------------+----------
   Hussein Manji |         0          8 |         8 
                 |      0.00     100.00 |    100.00 
-----------------+----------------------+----------
       Reinfrida |         0         17 |        17 
                 |      0.00     100.00 |    100.00 
-----------------+----------------------+----------
Richard Mashauri |         1          5 |         6 
                 |     16.67      83.33 |    100.00 
-----------------+----------------------+----------
 Sumayyah Saudin |         2         11 |        13 
                 |     15.38      84.62 |    100.00 
-----------------+----------------------+----------
     Wafaa Razak |         0          9 |         9 
                 |      0.00     100.00 |    100.00 
-----------------+----------------------+----------
    Waziri Gahhu |         3         13 |        16 
                 |     18.75      81.25 |    100.00 
-----------------+----------------------+----------
           Total |         7         68 |        75 
                 |      9.33      90.67 |    100.00 


. tab RMO MET, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                 |          MET
             RMO |         M         NM |     Total
-----------------+----------------------+----------
  Elishah Premji |         6          5 |        11 
                 |     54.55      45.45 |    100.00 
-----------------+----------------------+----------
      Frank Swai |         6         10 |        16 
                 |     37.50      62.50 |    100.00 
-----------------+----------------------+----------
   Hussein Manji |        18          9 |        27 
                 |     66.67      33.33 |    100.00 
-----------------+----------------------+----------
       Reinfrida |        34         17 |        51 
                 |     66.67      33.33 |    100.00 
-----------------+----------------------+----------
Richard Mashauri |        14         11 |        25 
                 |     56.00      44.00 |    100.00 
-----------------+----------------------+----------
 Sumayyah Saudin |        32         18 |        50 
                 |     64.00      36.00 |    100.00 
-----------------+----------------------+----------
     Wafaa Razak |        22          7 |        29 
                 |     75.86      24.14 |    100.00 
-----------------+----------------------+----------
    Waziri Gahhu |        38         17 |        55 
                 |     69.09      30.91 |    100.00 
-----------------+----------------------+----------
           Total |       170         94 |       264 
                 |     64.39      35.61 |    100.00 


. 
. ///Nurses
> //Overall
. tab DOCUMENTED if TYPE == "N"

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |        189       90.43       90.43
         ND |         20        9.57      100.00
------------+-----------------------------------
      Total |        209      100.00

. tab TIMELY if TYPE == "N" & DOCUMENTED == "D"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |          2        1.06        1.06
          Y |        187       98.94      100.00
------------+-----------------------------------
      Total |        189      100.00

. tab LEGIBLE if TYPE == "N" & DOCUMENTED == "D"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         39       20.63       20.63
          Y |        150       79.37      100.00
------------+-----------------------------------
      Total |        189      100.00

. tab COMPLETE if TYPE == "N" & DOCUMENTED == "D"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         18        9.52        9.52
          Y |        171       90.48      100.00
------------+-----------------------------------
      Total |        189      100.00

. tab MET if TYPE == "N"

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |        134       64.11       64.11
         NM |         75       35.89      100.00
------------+-----------------------------------
      Total |        209      100.00

. 
. //Nursing documents
. tab DOCUMENTS DOCUMENTED if TYPE == "N", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |      DOCUMENTED
            DOCUMENTS |         D         ND |     Total
----------------------+----------------------+----------
Appropriate pain as.. |        41          3 |        44 
                      |     93.18       6.82 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |        26          7 |        33 
                      |     78.79      21.21 |    100.00 
----------------------+----------------------+----------
Fall Risk Assessmen.. |        40          4 |        44 
                      |     90.91       9.09 |    100.00 
----------------------+----------------------+----------
Nursing Initial Ass.. |        41          3 |        44 
                      |     93.18       6.82 |    100.00 
----------------------+----------------------+----------
Nursing Re-Assessme.. |        41          3 |        44 
                      |     93.18       6.82 |    100.00 
----------------------+----------------------+----------
                Total |       189         20 |       209 
                      |     90.43       9.57 |    100.00 


. tab DOCUMENTS TIMELY if TYPE == "N" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        TIMELY
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Appropriate pain as.. |         0         41 |        41 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         1         25 |        26 
                      |      3.85      96.15 |    100.00 
----------------------+----------------------+----------
Fall Risk Assessmen.. |         1         39 |        40 
                      |      2.50      97.50 |    100.00 
----------------------+----------------------+----------
Nursing Initial Ass.. |         0         41 |        41 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Nursing Re-Assessme.. |         0         41 |        41 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
                Total |         2        187 |       189 
                      |      1.06      98.94 |    100.00 


. tab DOCUMENTS LEGIBLE if TYPE == "N" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Appropriate pain as.. |         1         40 |        41 
                      |      2.44      97.56 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         2         24 |        26 
                      |      7.69      92.31 |    100.00 
----------------------+----------------------+----------
Fall Risk Assessmen.. |         7         33 |        40 
                      |     17.50      82.50 |    100.00 
----------------------+----------------------+----------
Nursing Initial Ass.. |        24         17 |        41 
                      |     58.54      41.46 |    100.00 
----------------------+----------------------+----------
Nursing Re-Assessme.. |         5         36 |        41 
                      |     12.20      87.80 |    100.00 
----------------------+----------------------+----------
                Total |        39        150 |       189 
                      |     20.63      79.37 |    100.00 


. tab DOCUMENTS COMPLETE if TYPE == "N" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |       COMPLETE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Appropriate pain as.. |         2         39 |        41 
                      |      4.88      95.12 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         2         24 |        26 
                      |      7.69      92.31 |    100.00 
----------------------+----------------------+----------
Fall Risk Assessmen.. |         1         39 |        40 
                      |      2.50      97.50 |    100.00 
----------------------+----------------------+----------
Nursing Initial Ass.. |         8         33 |        41 
                      |     19.51      80.49 |    100.00 
----------------------+----------------------+----------
Nursing Re-Assessme.. |         5         36 |        41 
                      |     12.20      87.80 |    100.00 
----------------------+----------------------+----------
                Total |        18        171 |       189 
                      |      9.52      90.48 |    100.00 


. tab DOCUMENTS MET if TYPE == "N", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
            DOCUMENTS |         M         NM |     Total
----------------------+----------------------+----------
Appropriate pain as.. |        38          6 |        44 
                      |     86.36      13.64 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |        21         12 |        33 
                      |     63.64      36.36 |    100.00 
----------------------+----------------------+----------
Fall Risk Assessmen.. |        31         13 |        44 
                      |     70.45      29.55 |    100.00 
----------------------+----------------------+----------
Nursing Initial Ass.. |        13         31 |        44 
                      |     29.55      70.45 |    100.00 
----------------------+----------------------+----------
Nursing Re-Assessme.. |        31         13 |        44 
                      |     70.45      29.55 |    100.00 
----------------------+----------------------+----------
                Total |       134         75 |       209 
                      |     64.11      35.89 |    100.00 


. 
. //Per Nurse
. tab NURSE DOCUMENTED if TYPE == "N", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

               |      DOCUMENTED
         NURSE |         D         ND |     Total
---------------+----------------------+----------
        Basili |         4          0 |         4 
               |    100.00       0.00 |    100.00 
---------------+----------------------+----------
      Batulana |        22          1 |        23 
               |     95.65       4.35 |    100.00 
---------------+----------------------+----------
        Biseko |        14          5 |        19 
               |     73.68      26.32 |    100.00 
---------------+----------------------+----------
     Christina |        24          5 |        29 
               |     82.76      17.24 |    100.00 
---------------+----------------------+----------
    Clementina |        18          2 |        20 
               |     90.00      10.00 |    100.00 
---------------+----------------------+----------
         Glory |        24          0 |        24 
               |    100.00       0.00 |    100.00 
---------------+----------------------+----------
        Isaack |        15          5 |        20 
               |     75.00      25.00 |    100.00 
---------------+----------------------+----------
         James |        13          1 |        14 
               |     92.86       7.14 |    100.00 
---------------+----------------------+----------
        Living |         5          0 |         5 
               |    100.00       0.00 |    100.00 
---------------+----------------------+----------
        Maalim |        17          0 |        17 
               |    100.00       0.00 |    100.00 
---------------+----------------------+----------
Michael Mahilu |        10          0 |        10 
               |    100.00       0.00 |    100.00 
---------------+----------------------+----------
         Saumu |        17          1 |        18 
               |     94.44       5.56 |    100.00 
---------------+----------------------+----------
         Silas |         6          0 |         6 
               |    100.00       0.00 |    100.00 
---------------+----------------------+----------
         Total |       189         20 |       209 
               |     90.43       9.57 |    100.00 


. tab NURSE TIMELY if TYPE == "N" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

               |        TIMELY
         NURSE |         N          Y |     Total
---------------+----------------------+----------
        Basili |         0          4 |         4 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
      Batulana |         1         21 |        22 
               |      4.55      95.45 |    100.00 
---------------+----------------------+----------
        Biseko |         0         14 |        14 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
     Christina |         0         24 |        24 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
    Clementina |         0         18 |        18 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
         Glory |         0         24 |        24 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
        Isaack |         0         15 |        15 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
         James |         0         13 |        13 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
        Living |         0          5 |         5 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
        Maalim |         0         17 |        17 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
Michael Mahilu |         0         10 |        10 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
         Saumu |         1         16 |        17 
               |      5.88      94.12 |    100.00 
---------------+----------------------+----------
         Silas |         0          6 |         6 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
         Total |         2        187 |       189 
               |      1.06      98.94 |    100.00 


. tab NURSE LEGIBLE if TYPE == "N" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

               |        LEGIBLE
         NURSE |         N          Y |     Total
---------------+----------------------+----------
        Basili |         0          4 |         4 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
      Batulana |         3         19 |        22 
               |     13.64      86.36 |    100.00 
---------------+----------------------+----------
        Biseko |         4         10 |        14 
               |     28.57      71.43 |    100.00 
---------------+----------------------+----------
     Christina |         3         21 |        24 
               |     12.50      87.50 |    100.00 
---------------+----------------------+----------
    Clementina |         4         14 |        18 
               |     22.22      77.78 |    100.00 
---------------+----------------------+----------
         Glory |         7         17 |        24 
               |     29.17      70.83 |    100.00 
---------------+----------------------+----------
        Isaack |         2         13 |        15 
               |     13.33      86.67 |    100.00 
---------------+----------------------+----------
         James |         6          7 |        13 
               |     46.15      53.85 |    100.00 
---------------+----------------------+----------
        Living |         0          5 |         5 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
        Maalim |         4         13 |        17 
               |     23.53      76.47 |    100.00 
---------------+----------------------+----------
Michael Mahilu |         1          9 |        10 
               |     10.00      90.00 |    100.00 
---------------+----------------------+----------
         Saumu |         4         13 |        17 
               |     23.53      76.47 |    100.00 
---------------+----------------------+----------
         Silas |         1          5 |         6 
               |     16.67      83.33 |    100.00 
---------------+----------------------+----------
         Total |        39        150 |       189 
               |     20.63      79.37 |    100.00 


. tab NURSE COMPLETE if TYPE == "N" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

               |       COMPLETE
         NURSE |         N          Y |     Total
---------------+----------------------+----------
        Basili |         1          3 |         4 
               |     25.00      75.00 |    100.00 
---------------+----------------------+----------
      Batulana |         2         20 |        22 
               |      9.09      90.91 |    100.00 
---------------+----------------------+----------
        Biseko |         0         14 |        14 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
     Christina |         1         23 |        24 
               |      4.17      95.83 |    100.00 
---------------+----------------------+----------
    Clementina |         0         18 |        18 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
         Glory |         5         19 |        24 
               |     20.83      79.17 |    100.00 
---------------+----------------------+----------
        Isaack |         0         15 |        15 
               |      0.00     100.00 |    100.00 
---------------+----------------------+----------
         James |         1         12 |        13 
               |      7.69      92.31 |    100.00 
---------------+----------------------+----------
        Living |         1          4 |         5 
               |     20.00      80.00 |    100.00 
---------------+----------------------+----------
        Maalim |         3         14 |        17 
               |     17.65      82.35 |    100.00 
---------------+----------------------+----------
Michael Mahilu |         1          9 |        10 
               |     10.00      90.00 |    100.00 
---------------+----------------------+----------
         Saumu |         2         15 |        17 
               |     11.76      88.24 |    100.00 
---------------+----------------------+----------
         Silas |         1          5 |         6 
               |     16.67      83.33 |    100.00 
---------------+----------------------+----------
         Total |        18        171 |       189 
               |      9.52      90.48 |    100.00 


. tab NURSE MET, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

               |          MET
         NURSE |         M         NM |     Total
---------------+----------------------+----------
        Basili |         4          1 |         5 
               |     80.00      20.00 |    100.00 
---------------+----------------------+----------
      Batulana |        24         10 |        34 
               |     70.59      29.41 |    100.00 
---------------+----------------------+----------
        Biseko |        14         14 |        28 
               |     50.00      50.00 |    100.00 
---------------+----------------------+----------
     Christina |        23         14 |        37 
               |     62.16      37.84 |    100.00 
---------------+----------------------+----------
    Clementina |        18          8 |        26 
               |     69.23      30.77 |    100.00 
---------------+----------------------+----------
         Glory |        22         11 |        33 
               |     66.67      33.33 |    100.00 
---------------+----------------------+----------
        Isaack |        17         10 |        27 
               |     62.96      37.04 |    100.00 
---------------+----------------------+----------
         James |        12          9 |        21 
               |     57.14      42.86 |    100.00 
---------------+----------------------+----------
        Living |         7          1 |         8 
               |     87.50      12.50 |    100.00 
---------------+----------------------+----------
        Maalim |        20          7 |        27 
               |     74.07      25.93 |    100.00 
---------------+----------------------+----------
Michael Mahilu |        12          4 |        16 
               |     75.00      25.00 |    100.00 
---------------+----------------------+----------
         Saumu |        13         13 |        26 
               |     50.00      50.00 |    100.00 
---------------+----------------------+----------
         Silas |         5          4 |         9 
               |     55.56      44.44 |    100.00 
---------------+----------------------+----------
         Total |       191        106 |       297 
               |     64.31      35.69 |    100.00 


. 
end of do-file

. 

. clear

. 

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. import delimited "D:/Work/QPS/Closed Charts/Monthly working files/Closed Charts Software Outputs/2020/All departments/Q3/OME DET
> AILS JULY - SEPTEMBER 2020.csv", case(upper)
(18 vars, 17,650 obs)

. 
end of do-file

. browse DOCUMENTED TIMELY LEGIBLE COMPLETE MET

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. drop if MET == "NA"
(10,494 observations deleted)

. keep if DEPT == "DOA"
(6,459 observations deleted)

. 
end of do-file

. browse DOCUMENTS TYPE DOCUMENTED TIMELY LEGIBLE COMPLETE MET

. browse SNN TYPE DOCUMENTED TIMELY LEGIBLE COMPLETE MET

. 

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. tab DOCUMENTED if TYPE == "N"

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |        130       99.24       99.24
         ND |          1        0.76      100.00
------------+-----------------------------------
      Total |        131      100.00

. tab TIMELY if TYPE == "N"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          - |          1        0.76        0.76
          N |         15       11.45       12.21
          Y |        115       87.79      100.00
------------+-----------------------------------
      Total |        131      100.00

. tab LEGIBLE if TYPE == "N"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          - |          1        0.76        0.76
          N |         15       11.45       12.21
          Y |        115       87.79      100.00
------------+-----------------------------------
      Total |        131      100.00

. tab COMPLETE if TYPE == "N"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          - |          1        0.76        0.76
          N |         11        8.40        9.16
          Y |        119       90.84      100.00
------------+-----------------------------------
      Total |        131      100.00

. tab MET if TYPE == "N"

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |         96       73.28       73.28
         NM |         35       26.72      100.00
------------+-----------------------------------
      Total |        131      100.00

. 
end of do-file

. 

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. ////Departmental Results
> //Overall percentages
. tab DOCUMENTED

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |        694       99.57       99.57
         ND |          3        0.43      100.00
------------+-----------------------------------
      Total |        697      100.00

. tab TIMELY if DOCUMENTED == "D"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         20        2.88        2.88
          Y |        674       97.12      100.00
------------+-----------------------------------
      Total |        694      100.00

. tab LEGIBLE if DOCUMENTED == "D"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         59        8.50        8.50
          Y |        635       91.50      100.00
------------+-----------------------------------
      Total |        694      100.00

. tab COMPLETE if DOCUMENTED == "D"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         27        3.89        3.89
          Y |        667       96.11      100.00
------------+-----------------------------------
      Total |        694      100.00

. tab MET

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |        598       85.80       85.80
         NM |         99       14.20      100.00
------------+-----------------------------------
      Total |        697      100.00

. 
. //Percentages per document for each Statistic
. tab DOCUMENTS DOCUMENTED, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |      DOCUMENTED
            DOCUMENTS |         D         ND |     Total
----------------------+----------------------+----------
Check Consent forms.. |       113          0 |       113 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |        18          0 |        18 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
Discharge/Transfer/.. |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |       113          0 |       113 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |       112          0 |       112 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
Patient care orders.. |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Patient care orders.. |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |       112          0 |       112 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |       113          0 |       113 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |       113          0 |       113 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
                Total |       694          3 |       697 
                      |     99.57       0.43 |    100.00 


. tab DOCUMENTS TIMELY if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        TIMELY
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         0         18 |        18 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         3        110 |       113 
                      |      2.65      97.35 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |         1        111 |       112 
                      |      0.89      99.11 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        15         97 |       112 
                      |     13.39      86.61 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |         1        112 |       113 
                      |      0.88      99.12 |    100.00 
----------------------+----------------------+----------
                Total |        20        674 |       694 
                      |      2.88      97.12 |    100.00 


. tab DOCUMENTS LEGIBLE if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         0         18 |        18 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         3        110 |       113 
                      |      2.65      97.35 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |        13         99 |       112 
                      |     11.61      88.39 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        15         97 |       112 
                      |     13.39      86.61 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        24         89 |       113 
                      |     21.24      78.76 |    100.00 
----------------------+----------------------+----------
                Total |        59        635 |       694 
                      |      8.50      91.50 |    100.00 


. tab DOCUMENTS COMPLETE if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |       COMPLETE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         1         17 |        18 
                      |      5.56      94.44 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         1        112 |       113 
                      |      0.88      99.12 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |         0        112 |       112 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        10        102 |       112 
                      |      8.93      91.07 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         5        108 |       113 
                      |      4.42      95.58 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        10        103 |       113 
                      |      8.85      91.15 |    100.00 
----------------------+----------------------+----------
                Total |        27        667 |       694 
                      |      3.89      96.11 |    100.00 


. tab DOCUMENTS MET, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
            DOCUMENTS |         M         NM |     Total
----------------------+----------------------+----------
Check Consent forms.. |       111          2 |       113 
                      |     98.23       1.77 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |        17          1 |        18 
                      |     94.44       5.56 |    100.00 
----------------------+----------------------+----------
Discharge/Transfer/.. |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |       106          7 |       113 
                      |     93.81       6.19 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |        98         14 |       112 
                      |     87.50      12.50 |    100.00 
----------------------+----------------------+----------
Patient care orders.. |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Patient care orders.. |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        79         33 |       112 
                      |     70.54      29.46 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |       106          7 |       113 
                      |     93.81       6.19 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        81         32 |       113 
                      |     71.68      28.32 |    100.00 
----------------------+----------------------+----------
                Total |       598         99 |       697 
                      |     85.80      14.20 |    100.00 


. 
. 
. 
. ////Group summaries
> ///Physicians
> //Overall
. tab DOCUMENTED if TYPE == "P"

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |        564       99.65       99.65
         ND |          2        0.35      100.00
------------+-----------------------------------
      Total |        566      100.00

. tab TIMELY if TYPE == "P" & DOCUMENTED == "D"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |          5        0.89        0.89
          Y |        559       99.11      100.00
------------+-----------------------------------
      Total |        564      100.00

. tab LEGIBLE if TYPE == "P" & DOCUMENTED == "D"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         44        7.80        7.80
          Y |        520       92.20      100.00
------------+-----------------------------------
      Total |        564      100.00

. tab COMPLETE if TYPE == "P" & DOCUMENTED == "D"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         16        2.84        2.84
          Y |        548       97.16      100.00
------------+-----------------------------------
      Total |        564      100.00

. tab MET if TYPE == "P"

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |        502       88.69       88.69
         NM |         64       11.31      100.00
------------+-----------------------------------
      Total |        566      100.00

. 
. //Physician documents
. tab DOCUMENTS DOCUMENTED if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |      DOCUMENTED
            DOCUMENTS |         D         ND |     Total
----------------------+----------------------+----------
Check Consent forms.. |       113          0 |       113 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
Discharge/Transfer/.. |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |       113          0 |       113 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |       112          0 |       112 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
Patient care orders.. |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |       113          0 |       113 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |       113          0 |       113 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
                Total |       564          2 |       566 
                      |     99.65       0.35 |    100.00 


. tab DOCUMENTS TIMELY if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        TIMELY
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         3        110 |       113 
                      |      2.65      97.35 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |         1        111 |       112 
                      |      0.89      99.11 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |         1        112 |       113 
                      |      0.88      99.12 |    100.00 
----------------------+----------------------+----------
                Total |         5        559 |       564 
                      |      0.89      99.11 |    100.00 


. tab DOCUMENTS LEGIBLE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         3        110 |       113 
                      |      2.65      97.35 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |        13         99 |       112 
                      |     11.61      88.39 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        24         89 |       113 
                      |     21.24      78.76 |    100.00 
----------------------+----------------------+----------
                Total |        44        520 |       564 
                      |      7.80      92.20 |    100.00 


. tab DOCUMENTS COMPLETE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |       COMPLETE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         1        112 |       113 
                      |      0.88      99.12 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |         0        112 |       112 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         5        108 |       113 
                      |      4.42      95.58 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        10        103 |       113 
                      |      8.85      91.15 |    100.00 
----------------------+----------------------+----------
                Total |        16        548 |       564 
                      |      2.84      97.16 |    100.00 


. tab DOCUMENTS MET if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
            DOCUMENTS |         M         NM |     Total
----------------------+----------------------+----------
Check Consent forms.. |       111          2 |       113 
                      |     98.23       1.77 |    100.00 
----------------------+----------------------+----------
Discharge/Transfer/.. |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |       106          7 |       113 
                      |     93.81       6.19 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |        98         14 |       112 
                      |     87.50      12.50 |    100.00 
----------------------+----------------------+----------
Patient care orders.. |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |       106          7 |       113 
                      |     93.81       6.19 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        81         32 |       113 
                      |     71.68      28.32 |    100.00 
----------------------+----------------------+----------
                Total |       502         64 |       566 
                      |     88.69      11.31 |    100.00 


. 
. //Per Physician
. tab DOCTOR DOCUMENTED if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |      DOCUMENTED
               DOCTOR |         D         ND |     Total
----------------------+----------------------+----------
           Huho, John |        51          1 |        52 
                      |     98.08       1.92 |    100.00 
----------------------+----------------------+----------
        Kiviri, Willy |         4          0 |         4 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
      Lydenge, Faraji |       117          0 |       117 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
    Mabusi, Lukansola |        13          1 |        14 
                      |     92.86       7.14 |    100.00 
----------------------+----------------------+----------
        Meza, Wilfred |         5          0 |         5 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
       Msimbe, Mariam |         9          0 |         9 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
     Nyaulingo, David |        86          0 |        86 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
              Raymond |         2          0 |         2 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
               Steven |       166          0 |       166 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
     Tembo, Frederick |       111          0 |       111 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
                Total |       564          2 |       566 
                      |     99.65       0.35 |    100.00 


. tab DOCTOR TIMELY if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        TIMELY
               DOCTOR |         N          Y |     Total
----------------------+----------------------+----------
           Huho, John |         1         50 |        51 
                      |      1.96      98.04 |    100.00 
----------------------+----------------------+----------
        Kiviri, Willy |         0          4 |         4 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
      Lydenge, Faraji |         0        117 |       117 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
    Mabusi, Lukansola |         0         13 |        13 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
        Meza, Wilfred |         0          5 |         5 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
       Msimbe, Mariam |         0          9 |         9 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
     Nyaulingo, David |         2         84 |        86 
                      |      2.33      97.67 |    100.00 
----------------------+----------------------+----------
              Raymond |         0          2 |         2 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
               Steven |         0        166 |       166 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
     Tembo, Frederick |         2        109 |       111 
                      |      1.80      98.20 |    100.00 
----------------------+----------------------+----------
                Total |         5        559 |       564 
                      |      0.89      99.11 |    100.00 


. tab DOCTOR LEGIBLE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
               DOCTOR |         N          Y |     Total
----------------------+----------------------+----------
           Huho, John |         1         50 |        51 
                      |      1.96      98.04 |    100.00 
----------------------+----------------------+----------
        Kiviri, Willy |         0          4 |         4 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
      Lydenge, Faraji |         7        110 |       117 
                      |      5.98      94.02 |    100.00 
----------------------+----------------------+----------
    Mabusi, Lukansola |         2         11 |        13 
                      |     15.38      84.62 |    100.00 
----------------------+----------------------+----------
        Meza, Wilfred |         0          5 |         5 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
       Msimbe, Mariam |         3          6 |         9 
                      |     33.33      66.67 |    100.00 
----------------------+----------------------+----------
     Nyaulingo, David |         3         83 |        86 
                      |      3.49      96.51 |    100.00 
----------------------+----------------------+----------
              Raymond |         0          2 |         2 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
               Steven |        10        156 |       166 
                      |      6.02      93.98 |    100.00 
----------------------+----------------------+----------
     Tembo, Frederick |        18         93 |       111 
                      |     16.22      83.78 |    100.00 
----------------------+----------------------+----------
                Total |        44        520 |       564 
                      |      7.80      92.20 |    100.00 


. tab DOCTOR COMPLETE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |       COMPLETE
               DOCTOR |         N          Y |     Total
----------------------+----------------------+----------
           Huho, John |         2         49 |        51 
                      |      3.92      96.08 |    100.00 
----------------------+----------------------+----------
        Kiviri, Willy |         0          4 |         4 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
      Lydenge, Faraji |         3        114 |       117 
                      |      2.56      97.44 |    100.00 
----------------------+----------------------+----------
    Mabusi, Lukansola |         0         13 |        13 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
        Meza, Wilfred |         0          5 |         5 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
       Msimbe, Mariam |         0          9 |         9 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
     Nyaulingo, David |         6         80 |        86 
                      |      6.98      93.02 |    100.00 
----------------------+----------------------+----------
              Raymond |         1          1 |         2 
                      |     50.00      50.00 |    100.00 
----------------------+----------------------+----------
               Steven |         1        165 |       166 
                      |      0.60      99.40 |    100.00 
----------------------+----------------------+----------
     Tembo, Frederick |         3        108 |       111 
                      |      2.70      97.30 |    100.00 
----------------------+----------------------+----------
                Total |        16        548 |       564 
                      |      2.84      97.16 |    100.00 


. tab DOCTOR MET if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
               DOCTOR |         M         NM |     Total
----------------------+----------------------+----------
           Huho, John |        47          5 |        52 
                      |     90.38       9.62 |    100.00 
----------------------+----------------------+----------
        Kiviri, Willy |         4          0 |         4 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
      Lydenge, Faraji |       108          9 |       117 
                      |     92.31       7.69 |    100.00 
----------------------+----------------------+----------
    Mabusi, Lukansola |        11          3 |        14 
                      |     78.57      21.43 |    100.00 
----------------------+----------------------+----------
        Meza, Wilfred |         5          0 |         5 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
       Msimbe, Mariam |         6          3 |         9 
                      |     66.67      33.33 |    100.00 
----------------------+----------------------+----------
     Nyaulingo, David |        76         10 |        86 
                      |     88.37      11.63 |    100.00 
----------------------+----------------------+----------
              Raymond |         1          1 |         2 
                      |     50.00      50.00 |    100.00 
----------------------+----------------------+----------
               Steven |       155         11 |       166 
                      |     93.37       6.63 |    100.00 
----------------------+----------------------+----------
     Tembo, Frederick |        89         22 |       111 
                      |     80.18      19.82 |    100.00 
----------------------+----------------------+----------
                Total |       502         64 |       566 
                      |     88.69      11.31 |    100.00 


. 
. ///Nurses
> //Overall
. tab DOCUMENTED if TYPE == "N"

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |        130       99.24       99.24
         ND |          1        0.76      100.00
------------+-----------------------------------
      Total |        131      100.00

. tab TIMELY if TYPE == "N" & DOCUMENTED == "D"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         15       11.54       11.54
          Y |        115       88.46      100.00
------------+-----------------------------------
      Total |        130      100.00

. tab LEGIBLE if TYPE == "N" & DOCUMENTED == "D"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         15       11.54       11.54
          Y |        115       88.46      100.00
------------+-----------------------------------
      Total |        130      100.00

. tab COMPLETE if TYPE == "N" & DOCUMENTED == "D"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         11        8.46        8.46
          Y |        119       91.54      100.00
------------+-----------------------------------
      Total |        130      100.00

. tab MET if TYPE == "N"

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |         96       73.28       73.28
         NM |         35       26.72      100.00
------------+-----------------------------------
      Total |        131      100.00

. 
. //Nursing documents
. tab DOCUMENTS DOCUMENTED if TYPE == "N", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |      DOCUMENTED
            DOCUMENTS |         D         ND |     Total
----------------------+----------------------+----------
Daily CPOE orders a.. |        18          0 |        18 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
Patient care orders.. |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |       112          0 |       112 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
                Total |       130          1 |       131 
                      |     99.24       0.76 |    100.00 


. tab DOCUMENTS TIMELY if TYPE == "N" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        TIMELY
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Daily CPOE orders a.. |         0         18 |        18 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        15         97 |       112 
                      |     13.39      86.61 |    100.00 
----------------------+----------------------+----------
                Total |        15        115 |       130 
                      |     11.54      88.46 |    100.00 


. tab DOCUMENTS LEGIBLE if TYPE == "N" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Daily CPOE orders a.. |         0         18 |        18 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        15         97 |       112 
                      |     13.39      86.61 |    100.00 
----------------------+----------------------+----------
                Total |        15        115 |       130 
                      |     11.54      88.46 |    100.00 


. tab DOCUMENTS COMPLETE if TYPE == "N" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |       COMPLETE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Daily CPOE orders a.. |         1         17 |        18 
                      |      5.56      94.44 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        10        102 |       112 
                      |      8.93      91.07 |    100.00 
----------------------+----------------------+----------
                Total |        11        119 |       130 
                      |      8.46      91.54 |    100.00 


. tab DOCUMENTS MET if TYPE == "N", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
            DOCUMENTS |         M         NM |     Total
----------------------+----------------------+----------
Daily CPOE orders a.. |        17          1 |        18 
                      |     94.44       5.56 |    100.00 
----------------------+----------------------+----------
Patient care orders.. |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        79         33 |       112 
                      |     70.54      29.46 |    100.00 
----------------------+----------------------+----------
                Total |        96         35 |       131 
                      |     73.28      26.72 |    100.00 


. 
end of do-file

. 

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. destring SNN, replace
SNN already numeric; no replace

. keep if (SNN == 1.3 | SNN == 4.1 | SNN == 4.2 | SNN == 5.1 | SNN == 5.2 | SNN == 5.3 | SNN == 5.5 | SNN == 7.2)
(584 observations deleted)

. 
end of do-file

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. ////Departmental Results
> //Overall percentages
. tab DOCUMENTED

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |        113      100.00      100.00
------------+-----------------------------------
      Total |        113      100.00

. tab TIMELY if DOCUMENTED == "D"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          Y |        113      100.00      100.00
------------+-----------------------------------
      Total |        113      100.00

. tab LEGIBLE if DOCUMENTED == "D"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |          2        1.77        1.77
          Y |        111       98.23      100.00
------------+-----------------------------------
      Total |        113      100.00

. tab COMPLETE if DOCUMENTED == "D"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          Y |        113      100.00      100.00
------------+-----------------------------------
      Total |        113      100.00

. tab MET

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |        111       98.23       98.23
         NM |          2        1.77      100.00
------------+-----------------------------------
      Total |        113      100.00

. 
. //Percentages per document for each Statistic
. tab DOCUMENTS DOCUMENTED, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      | DOCUMENTED
            DOCUMENTS |         D |     Total
----------------------+-----------+----------
Check Consent forms.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       113 |       113 
                      |    100.00 |    100.00 


. tab DOCUMENTS TIMELY if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |   TIMELY
            DOCUMENTS |         Y |     Total
----------------------+-----------+----------
Check Consent forms.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       113 |       113 
                      |    100.00 |    100.00 


. tab DOCUMENTS LEGIBLE if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
                Total |         2        111 |       113 
                      |      1.77      98.23 |    100.00 


. tab DOCUMENTS COMPLETE if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |  COMPLETE
            DOCUMENTS |         Y |     Total
----------------------+-----------+----------
Check Consent forms.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       113 |       113 
                      |    100.00 |    100.00 


. tab DOCUMENTS MET, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
            DOCUMENTS |         M         NM |     Total
----------------------+----------------------+----------
Check Consent forms.. |       111          2 |       113 
                      |     98.23       1.77 |    100.00 
----------------------+----------------------+----------
                Total |       111          2 |       113 
                      |     98.23       1.77 |    100.00 


. 
. 
. 
. ////Group summaries
> ///Physicians
> //Overall
. tab DOCUMENTED if TYPE == "P"

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |        113      100.00      100.00
------------+-----------------------------------
      Total |        113      100.00

. tab TIMELY if TYPE == "P" & DOCUMENTED == "D"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          Y |        113      100.00      100.00
------------+-----------------------------------
      Total |        113      100.00

. tab LEGIBLE if TYPE == "P" & DOCUMENTED == "D"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |          2        1.77        1.77
          Y |        111       98.23      100.00
------------+-----------------------------------
      Total |        113      100.00

. tab COMPLETE if TYPE == "P" & DOCUMENTED == "D"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          Y |        113      100.00      100.00
------------+-----------------------------------
      Total |        113      100.00

. tab MET if TYPE == "P"

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |        111       98.23       98.23
         NM |          2        1.77      100.00
------------+-----------------------------------
      Total |        113      100.00

. 
. //Physician documents
. tab DOCUMENTS DOCUMENTED if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      | DOCUMENTED
            DOCUMENTS |         D |     Total
----------------------+-----------+----------
Check Consent forms.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       113 |       113 
                      |    100.00 |    100.00 


. tab DOCUMENTS TIMELY if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |   TIMELY
            DOCUMENTS |         Y |     Total
----------------------+-----------+----------
Check Consent forms.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       113 |       113 
                      |    100.00 |    100.00 


. tab DOCUMENTS LEGIBLE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
                Total |         2        111 |       113 
                      |      1.77      98.23 |    100.00 


. tab DOCUMENTS COMPLETE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |  COMPLETE
            DOCUMENTS |         Y |     Total
----------------------+-----------+----------
Check Consent forms.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       113 |       113 
                      |    100.00 |    100.00 


. tab DOCUMENTS MET if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
            DOCUMENTS |         M         NM |     Total
----------------------+----------------------+----------
Check Consent forms.. |       111          2 |       113 
                      |     98.23       1.77 |    100.00 
----------------------+----------------------+----------
                Total |       111          2 |       113 
                      |     98.23       1.77 |    100.00 


. 
. //Per Physician
. tab DOCTOR DOCUMENTED if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      | DOCUMENTED
               DOCTOR |         D |     Total
----------------------+-----------+----------
           Huho, John |         3 |         3 
                      |    100.00 |    100.00 
----------------------+-----------+----------
        Kiviri, Willy |         1 |         1 
                      |    100.00 |    100.00 
----------------------+-----------+----------
      Lydenge, Faraji |        26 |        26 
                      |    100.00 |    100.00 
----------------------+-----------+----------
    Mabusi, Lukansola |         1 |         1 
                      |    100.00 |    100.00 
----------------------+-----------+----------
        Meza, Wilfred |         1 |         1 
                      |    100.00 |    100.00 
----------------------+-----------+----------
       Msimbe, Mariam |         1 |         1 
                      |    100.00 |    100.00 
----------------------+-----------+----------
     Nyaulingo, David |        10 |        10 
                      |    100.00 |    100.00 
----------------------+-----------+----------
               Steven |        42 |        42 
                      |    100.00 |    100.00 
----------------------+-----------+----------
     Tembo, Frederick |        28 |        28 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       113 |       113 
                      |    100.00 |    100.00 


. tab DOCTOR TIMELY if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |   TIMELY
               DOCTOR |         Y |     Total
----------------------+-----------+----------
           Huho, John |         3 |         3 
                      |    100.00 |    100.00 
----------------------+-----------+----------
        Kiviri, Willy |         1 |         1 
                      |    100.00 |    100.00 
----------------------+-----------+----------
      Lydenge, Faraji |        26 |        26 
                      |    100.00 |    100.00 
----------------------+-----------+----------
    Mabusi, Lukansola |         1 |         1 
                      |    100.00 |    100.00 
----------------------+-----------+----------
        Meza, Wilfred |         1 |         1 
                      |    100.00 |    100.00 
----------------------+-----------+----------
       Msimbe, Mariam |         1 |         1 
                      |    100.00 |    100.00 
----------------------+-----------+----------
     Nyaulingo, David |        10 |        10 
                      |    100.00 |    100.00 
----------------------+-----------+----------
               Steven |        42 |        42 
                      |    100.00 |    100.00 
----------------------+-----------+----------
     Tembo, Frederick |        28 |        28 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       113 |       113 
                      |    100.00 |    100.00 


. tab DOCTOR LEGIBLE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
               DOCTOR |         N          Y |     Total
----------------------+----------------------+----------
           Huho, John |         0          3 |         3 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
        Kiviri, Willy |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
      Lydenge, Faraji |         1         25 |        26 
                      |      3.85      96.15 |    100.00 
----------------------+----------------------+----------
    Mabusi, Lukansola |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
        Meza, Wilfred |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
       Msimbe, Mariam |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
     Nyaulingo, David |         0         10 |        10 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
               Steven |         0         42 |        42 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
     Tembo, Frederick |         1         27 |        28 
                      |      3.57      96.43 |    100.00 
----------------------+----------------------+----------
                Total |         2        111 |       113 
                      |      1.77      98.23 |    100.00 


. tab DOCTOR COMPLETE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |  COMPLETE
               DOCTOR |         Y |     Total
----------------------+-----------+----------
           Huho, John |         3 |         3 
                      |    100.00 |    100.00 
----------------------+-----------+----------
        Kiviri, Willy |         1 |         1 
                      |    100.00 |    100.00 
----------------------+-----------+----------
      Lydenge, Faraji |        26 |        26 
                      |    100.00 |    100.00 
----------------------+-----------+----------
    Mabusi, Lukansola |         1 |         1 
                      |    100.00 |    100.00 
----------------------+-----------+----------
        Meza, Wilfred |         1 |         1 
                      |    100.00 |    100.00 
----------------------+-----------+----------
       Msimbe, Mariam |         1 |         1 
                      |    100.00 |    100.00 
----------------------+-----------+----------
     Nyaulingo, David |        10 |        10 
                      |    100.00 |    100.00 
----------------------+-----------+----------
               Steven |        42 |        42 
                      |    100.00 |    100.00 
----------------------+-----------+----------
     Tembo, Frederick |        28 |        28 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       113 |       113 
                      |    100.00 |    100.00 


. tab DOCTOR MET if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
               DOCTOR |         M         NM |     Total
----------------------+----------------------+----------
           Huho, John |         3          0 |         3 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
        Kiviri, Willy |         1          0 |         1 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
      Lydenge, Faraji |        25          1 |        26 
                      |     96.15       3.85 |    100.00 
----------------------+----------------------+----------
    Mabusi, Lukansola |         1          0 |         1 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
        Meza, Wilfred |         1          0 |         1 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
       Msimbe, Mariam |         1          0 |         1 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
     Nyaulingo, David |        10          0 |        10 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
               Steven |        42          0 |        42 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
     Tembo, Frederick |        27          1 |        28 
                      |     96.43       3.57 |    100.00 
----------------------+----------------------+----------
                Total |       111          2 |       113 
                      |     98.23       1.77 |    100.00 


. 
. ///Nurses
> //Overall
. tab DOCUMENTED if TYPE == "N"
no observations

. tab TIMELY if TYPE == "N" & DOCUMENTED == "D"
no observations

. tab LEGIBLE if TYPE == "N" & DOCUMENTED == "D"
no observations

. tab COMPLETE if TYPE == "N" & DOCUMENTED == "D"
no observations

. tab MET if TYPE == "N"
no observations

. 
. //Nursing documents
. tab DOCUMENTS DOCUMENTED if TYPE == "N", row
no observations

. tab DOCUMENTS TIMELY if TYPE == "N" & DOCUMENTED == "D", row
no observations

. tab DOCUMENTS LEGIBLE if TYPE == "N" & DOCUMENTED == "D", row
no observations

. tab DOCUMENTS COMPLETE if TYPE == "N" & DOCUMENTED == "D", row
no observations

. tab DOCUMENTS MET if TYPE == "N", row
no observations

. 
end of do-file

. 

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. import delimited "D:/Work/QPS/Closed Charts/Monthly working files/Closed Charts Software Outputs/2020/All departments/Q3/OME DET
> AILS JULY - SEPTEMBER 2020.csv", case(upper)
no; data in memory would be lost
r(4);

end of do-file

r(4);

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. import delimited "D:/Work/QPS/Closed Charts/Monthly working files/Closed Charts Software Outputs/2020/All departments/Q3/OME DET
> AILS JULY - SEPTEMBER 2020.csv", case(upper)
no; data in memory would be lost
r(4);

end of do-file

r(4);

. 

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. import delimited "D:/Work/QPS/Closed Charts/Monthly working files/Closed Charts Software Outputs/2020/All departments/Q3/OME DET
> AILS JULY - SEPTEMBER 2020.csv", case(upper)
no; data in memory would be lost
r(4);

end of do-file

r(4);

. clear

. 

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. import delimited "D:/Work/QPS/Closed Charts/Monthly working files/Closed Charts Software Outputs/2020/All departments/Q3/OME DET
> AILS JULY - SEPTEMBER 2020.csv", case(upper)
(18 vars, 17,650 obs)

. 
end of do-file

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. drop if MET == "NA"
(10,494 observations deleted)

. keep if DEPT == "DOA"
(6,459 observations deleted)

. 
end of do-file

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. destring SNN, replace
SNN already numeric; no replace

. 
end of do-file

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. keep if (SNN == 1.3 | SNN == 4.1 | SNN == 4.2 | SNN == 5.1 | SNN == 5.2 | SNN == 5.3 | SNN == 5.5 | SNN == 7.2)
(584 observations deleted)

. 
end of do-file

. browse SNN TYPE DOCUMENTED TIMELY LEGIBLE COMPLETE MET

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. tab DOCUMENTED if TYPE == "N"
no observations

. tab TIMELY if TYPE == "N" & DOCUMENTED == "D"
no observations

. tab LEGIBLE if TYPE == "N" & DOCUMENTED == "D"
no observations

. tab COMPLETE if TYPE == "N" & DOCUMENTED == "D"
no observations

. tab MET if TYPE == "N"
no observations

. 
end of do-file

. tab COMPLETE if type == "N"
type not found
r(111);

. tab COMPLETE if TYPE == "N"
no observations

. keep if TYPE == "N"
(113 observations deleted)

. browse

. 

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. ///Closed Charts Analysis
> ///Department of Anaesthesia
> 
. clear

. set more off

. cd "D:\Work\QPS\Closed Charts\Programming\STATA\Closed Charts Analysis - Outputs"
D:\Work\QPS\Closed Charts\Programming\STATA\Closed Charts Analysis - Outputs

. 
. capture log close
