----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Work\QPS\Closed Charts\Programming\STATA\Closed Charts Analysis - Outputs\Anaesthesia.log
  log type:  text
 opened on:  23 Jan 2021, 20:04:16

. 
. import excel "D:/Work/QPS/Closed Charts/Monthly working files/Closed Charts Software Outputs/2020/All departments/Q3/OME DETAILS
>  JULY - SEPTEMBER 2020_ORIGINAL.xlsx", firstrow clear

. ///import delimited "D:/Work/QPS/Closed Charts/Monthly working files/Closed Charts Software Outputs/2020/All departments/Q3/OME 
> DETAILS JULY - SEPTEMBER 2020.csv", case(upper)
> 
. drop if MET == "NA"
(10,494 observations deleted)

. keep if DEPT == "DOA"
(6,459 observations deleted)

. 
. destring SNN, replace
SNN has all characters numeric; replaced as double

. keep if (SNN == 1.3 | SNN == 4.1 | SNN == 4.2 | SNN == 5.1 | SNN == 5.2 | SNN == 5.3 | SNN == 5.5 | SNN == 7.2)
(3 observations deleted)

. 
. ////Departmental Results
> //Overall percentages
. tab DOCUMENTED

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |        694      100.00      100.00
------------+-----------------------------------
      Total |        694      100.00

. tab TIMELY if DOCUMENTED == "D"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         20        2.88        2.88
          Y |        674       97.12      100.00
------------+-----------------------------------
      Total |        694      100.00

. tab LEGIBLE if DOCUMENTED == "D"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         59        8.50        8.50
          Y |        635       91.50      100.00
------------+-----------------------------------
      Total |        694      100.00

. tab COMPLETE if DOCUMENTED == "D"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         27        3.89        3.89
          Y |        667       96.11      100.00
------------+-----------------------------------
      Total |        694      100.00

. tab MET

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |        598       86.17       86.17
         NM |         96       13.83      100.00
------------+-----------------------------------
      Total |        694      100.00

. 
. //Percentages per document for each Statistic
. tab DOCUMENTS DOCUMENTED, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      | DOCUMENTED
            DOCUMENTS |         D |     Total
----------------------+-----------+----------
Check Consent forms.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Daily CPOE orders a.. |        18 |        18 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Informed Consent Fo.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Intraoperative Note.. |       112 |       112 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Post Anesthesia Rec.. |       112 |       112 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Pre-Operative (Anae.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Pre-Operative Anest.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       694 |       694 
                      |    100.00 |    100.00 


. tab DOCUMENTS TIMELY if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        TIMELY
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         0         18 |        18 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         3        110 |       113 
                      |      2.65      97.35 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |         1        111 |       112 
                      |      0.89      99.11 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        15         97 |       112 
                      |     13.39      86.61 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |         1        112 |       113 
                      |      0.88      99.12 |    100.00 
----------------------+----------------------+----------
                Total |        20        674 |       694 
                      |      2.88      97.12 |    100.00 


. tab DOCUMENTS LEGIBLE if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         0         18 |        18 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         3        110 |       113 
                      |      2.65      97.35 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |        13         99 |       112 
                      |     11.61      88.39 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        15         97 |       112 
                      |     13.39      86.61 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        24         89 |       113 
                      |     21.24      78.76 |    100.00 
----------------------+----------------------+----------
                Total |        59        635 |       694 
                      |      8.50      91.50 |    100.00 


. tab DOCUMENTS COMPLETE if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |       COMPLETE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         1         17 |        18 
                      |      5.56      94.44 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         1        112 |       113 
                      |      0.88      99.12 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |         0        112 |       112 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        10        102 |       112 
                      |      8.93      91.07 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         5        108 |       113 
                      |      4.42      95.58 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        10        103 |       113 
                      |      8.85      91.15 |    100.00 
----------------------+----------------------+----------
                Total |        27        667 |       694 
                      |      3.89      96.11 |    100.00 


. tab DOCUMENTS MET, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
            DOCUMENTS |         M         NM |     Total
----------------------+----------------------+----------
Check Consent forms.. |       111          2 |       113 
                      |     98.23       1.77 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |        17          1 |        18 
                      |     94.44       5.56 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |       106          7 |       113 
                      |     93.81       6.19 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |        98         14 |       112 
                      |     87.50      12.50 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        79         33 |       112 
                      |     70.54      29.46 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |       106          7 |       113 
                      |     93.81       6.19 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        81         32 |       113 
                      |     71.68      28.32 |    100.00 
----------------------+----------------------+----------
                Total |       598         96 |       694 
                      |     86.17      13.83 |    100.00 


. 
. 
. 
. ////Group summaries
> ///Physicians
> //Overall
. tab DOCUMENTED if TYPE == "P"

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |        564      100.00      100.00
------------+-----------------------------------
      Total |        564      100.00

. tab TIMELY if TYPE == "P" & DOCUMENTED == "D"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |          5        0.89        0.89
          Y |        559       99.11      100.00
------------+-----------------------------------
      Total |        564      100.00

. tab LEGIBLE if TYPE == "P" & DOCUMENTED == "D"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         44        7.80        7.80
          Y |        520       92.20      100.00
------------+-----------------------------------
      Total |        564      100.00

. tab COMPLETE if TYPE == "P" & DOCUMENTED == "D"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         16        2.84        2.84
          Y |        548       97.16      100.00
------------+-----------------------------------
      Total |        564      100.00

. tab MET if TYPE == "P"

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |        502       89.01       89.01
         NM |         62       10.99      100.00
------------+-----------------------------------
      Total |        564      100.00

. 
. //Physician documents
. tab DOCUMENTS DOCUMENTED if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      | DOCUMENTED
            DOCUMENTS |         D |     Total
----------------------+-----------+----------
Check Consent forms.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Informed Consent Fo.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Intraoperative Note.. |       112 |       112 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Pre-Operative (Anae.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Pre-Operative Anest.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       564 |       564 
                      |    100.00 |    100.00 


. tab DOCUMENTS TIMELY if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        TIMELY
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         3        110 |       113 
                      |      2.65      97.35 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |         1        111 |       112 
                      |      0.89      99.11 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |         1        112 |       113 
                      |      0.88      99.12 |    100.00 
----------------------+----------------------+----------
                Total |         5        559 |       564 
                      |      0.89      99.11 |    100.00 


. tab DOCUMENTS LEGIBLE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         3        110 |       113 
                      |      2.65      97.35 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |        13         99 |       112 
                      |     11.61      88.39 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        24         89 |       113 
                      |     21.24      78.76 |    100.00 
----------------------+----------------------+----------
                Total |        44        520 |       564 
                      |      7.80      92.20 |    100.00 


. tab DOCUMENTS COMPLETE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |       COMPLETE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         1        112 |       113 
                      |      0.88      99.12 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |         0        112 |       112 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         5        108 |       113 
                      |      4.42      95.58 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        10        103 |       113 
                      |      8.85      91.15 |    100.00 
----------------------+----------------------+----------
                Total |        16        548 |       564 
                      |      2.84      97.16 |    100.00 


. tab DOCUMENTS MET if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
            DOCUMENTS |         M         NM |     Total
----------------------+----------------------+----------
Check Consent forms.. |       111          2 |       113 
                      |     98.23       1.77 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |       106          7 |       113 
                      |     93.81       6.19 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |        98         14 |       112 
                      |     87.50      12.50 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |       106          7 |       113 
                      |     93.81       6.19 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        81         32 |       113 
                      |     71.68      28.32 |    100.00 
----------------------+----------------------+----------
                Total |       502         62 |       564 
                      |     89.01      10.99 |    100.00 


. 
. //Per Physician
. tab DOCTOR DOCUMENTED if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      | DOCUMENTED
               DOCTOR |         D |     Total
----------------------+-----------+----------
           Huho, John |        51 |        51 
                      |    100.00 |    100.00 
----------------------+-----------+----------
        Kiviri, Willy |         4 |         4 
                      |    100.00 |    100.00 
----------------------+-----------+----------
      Lydenge, Faraji |       117 |       117 
                      |    100.00 |    100.00 
----------------------+-----------+----------
    Mabusi, Lukansola |        13 |        13 
                      |    100.00 |    100.00 
----------------------+-----------+----------
        Meza, Wilfred |         5 |         5 
                      |    100.00 |    100.00 
----------------------+-----------+----------
       Msimbe, Mariam |         9 |         9 
                      |    100.00 |    100.00 
----------------------+-----------+----------
     Nyaulingo, David |        86 |        86 
                      |    100.00 |    100.00 
----------------------+-----------+----------
              Raymond |         2 |         2 
                      |    100.00 |    100.00 
----------------------+-----------+----------
               Steven |       166 |       166 
                      |    100.00 |    100.00 
----------------------+-----------+----------
     Tembo, Frederick |       111 |       111 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       564 |       564 
                      |    100.00 |    100.00 


. tab DOCTOR TIMELY if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        TIMELY
               DOCTOR |         N          Y |     Total
----------------------+----------------------+----------
           Huho, John |         1         50 |        51 
                      |      1.96      98.04 |    100.00 
----------------------+----------------------+----------
        Kiviri, Willy |         0          4 |         4 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
      Lydenge, Faraji |         0        117 |       117 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
    Mabusi, Lukansola |         0         13 |        13 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
        Meza, Wilfred |         0          5 |         5 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
       Msimbe, Mariam |         0          9 |         9 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
     Nyaulingo, David |         2         84 |        86 
                      |      2.33      97.67 |    100.00 
----------------------+----------------------+----------
              Raymond |         0          2 |         2 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
               Steven |         0        166 |       166 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
     Tembo, Frederick |         2        109 |       111 
                      |      1.80      98.20 |    100.00 
----------------------+----------------------+----------
                Total |         5        559 |       564 
                      |      0.89      99.11 |    100.00 


. tab DOCTOR LEGIBLE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
               DOCTOR |         N          Y |     Total
----------------------+----------------------+----------
           Huho, John |         1         50 |        51 
                      |      1.96      98.04 |    100.00 
----------------------+----------------------+----------
        Kiviri, Willy |         0          4 |         4 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
      Lydenge, Faraji |         7        110 |       117 
                      |      5.98      94.02 |    100.00 
----------------------+----------------------+----------
    Mabusi, Lukansola |         2         11 |        13 
                      |     15.38      84.62 |    100.00 
----------------------+----------------------+----------
        Meza, Wilfred |         0          5 |         5 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
       Msimbe, Mariam |         3          6 |         9 
                      |     33.33      66.67 |    100.00 
----------------------+----------------------+----------
     Nyaulingo, David |         3         83 |        86 
                      |      3.49      96.51 |    100.00 
----------------------+----------------------+----------
              Raymond |         0          2 |         2 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
               Steven |        10        156 |       166 
                      |      6.02      93.98 |    100.00 
----------------------+----------------------+----------
     Tembo, Frederick |        18         93 |       111 
                      |     16.22      83.78 |    100.00 
----------------------+----------------------+----------
                Total |        44        520 |       564 
                      |      7.80      92.20 |    100.00 


. tab DOCTOR COMPLETE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |       COMPLETE
               DOCTOR |         N          Y |     Total
----------------------+----------------------+----------
           Huho, John |         2         49 |        51 
                      |      3.92      96.08 |    100.00 
----------------------+----------------------+----------
        Kiviri, Willy |         0          4 |         4 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
      Lydenge, Faraji |         3        114 |       117 
                      |      2.56      97.44 |    100.00 
----------------------+----------------------+----------
    Mabusi, Lukansola |         0         13 |        13 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
        Meza, Wilfred |         0          5 |         5 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
       Msimbe, Mariam |         0          9 |         9 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
     Nyaulingo, David |         6         80 |        86 
                      |      6.98      93.02 |    100.00 
----------------------+----------------------+----------
              Raymond |         1          1 |         2 
                      |     50.00      50.00 |    100.00 
----------------------+----------------------+----------
               Steven |         1        165 |       166 
                      |      0.60      99.40 |    100.00 
----------------------+----------------------+----------
     Tembo, Frederick |         3        108 |       111 
                      |      2.70      97.30 |    100.00 
----------------------+----------------------+----------
                Total |        16        548 |       564 
                      |      2.84      97.16 |    100.00 


. tab DOCTOR MET if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
               DOCTOR |         M         NM |     Total
----------------------+----------------------+----------
           Huho, John |        47          4 |        51 
                      |     92.16       7.84 |    100.00 
----------------------+----------------------+----------
        Kiviri, Willy |         4          0 |         4 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
      Lydenge, Faraji |       108          9 |       117 
                      |     92.31       7.69 |    100.00 
----------------------+----------------------+----------
    Mabusi, Lukansola |        11          2 |        13 
                      |     84.62      15.38 |    100.00 
----------------------+----------------------+----------
        Meza, Wilfred |         5          0 |         5 
                      |    100.00       0.00 |    100.00 
----------------------+----------------------+----------
       Msimbe, Mariam |         6          3 |         9 
                      |     66.67      33.33 |    100.00 
----------------------+----------------------+----------
     Nyaulingo, David |        76         10 |        86 
                      |     88.37      11.63 |    100.00 
----------------------+----------------------+----------
              Raymond |         1          1 |         2 
                      |     50.00      50.00 |    100.00 
----------------------+----------------------+----------
               Steven |       155         11 |       166 
                      |     93.37       6.63 |    100.00 
----------------------+----------------------+----------
     Tembo, Frederick |        89         22 |       111 
                      |     80.18      19.82 |    100.00 
----------------------+----------------------+----------
                Total |       502         62 |       564 
                      |     89.01      10.99 |    100.00 


. 
. ///Nurses
> //Overall
. tab DOCUMENTED if TYPE == "N"

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |        130      100.00      100.00
------------+-----------------------------------
      Total |        130      100.00

. tab TIMELY if TYPE == "N" & DOCUMENTED == "D"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         15       11.54       11.54
          Y |        115       88.46      100.00
------------+-----------------------------------
      Total |        130      100.00

. tab LEGIBLE if TYPE == "N" & DOCUMENTED == "D"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         15       11.54       11.54
          Y |        115       88.46      100.00
------------+-----------------------------------
      Total |        130      100.00

. tab COMPLETE if TYPE == "N" & DOCUMENTED == "D"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         11        8.46        8.46
          Y |        119       91.54      100.00
------------+-----------------------------------
      Total |        130      100.00

. tab MET if TYPE == "N"

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |         96       73.85       73.85
         NM |         34       26.15      100.00
------------+-----------------------------------
      Total |        130      100.00

. 
. //Nursing documents
. tab DOCUMENTS DOCUMENTED if TYPE == "N", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      | DOCUMENTED
            DOCUMENTS |         D |     Total
----------------------+-----------+----------
Daily CPOE orders a.. |        18 |        18 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Post Anesthesia Rec.. |       112 |       112 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       130 |       130 
                      |    100.00 |    100.00 


. tab DOCUMENTS TIMELY if TYPE == "N" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        TIMELY
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Daily CPOE orders a.. |         0         18 |        18 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        15         97 |       112 
                      |     13.39      86.61 |    100.00 
----------------------+----------------------+----------
                Total |        15        115 |       130 
                      |     11.54      88.46 |    100.00 


. tab DOCUMENTS LEGIBLE if TYPE == "N" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Daily CPOE orders a.. |         0         18 |        18 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        15         97 |       112 
                      |     13.39      86.61 |    100.00 
----------------------+----------------------+----------
                Total |        15        115 |       130 
                      |     11.54      88.46 |    100.00 


. tab DOCUMENTS COMPLETE if TYPE == "N" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |       COMPLETE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Daily CPOE orders a.. |         1         17 |        18 
                      |      5.56      94.44 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        10        102 |       112 
                      |      8.93      91.07 |    100.00 
----------------------+----------------------+----------
                Total |        11        119 |       130 
                      |      8.46      91.54 |    100.00 


. tab DOCUMENTS MET if TYPE == "N", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
            DOCUMENTS |         M         NM |     Total
----------------------+----------------------+----------
Daily CPOE orders a.. |        17          1 |        18 
                      |     94.44       5.56 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        79         33 |       112 
                      |     70.54      29.46 |    100.00 
----------------------+----------------------+----------
                Total |        96         34 |       130 
                      |     73.85      26.15 |    100.00 


. 
end of do-file

. keep if DOCTOR == "Raymond"
(691 observations deleted)

. browse

. 

. clear

. do "C:\Users\AMRI~1.KYA\AppData\Local\Temp\STD01000000.tmp"

. import excel "D:/Work/QPS/Closed Charts/Monthly working files/Closed Charts Software Outputs/2020/All departments/Q3/OME DETAILS
>  JULY - SEPTEMBER 2020_ORIGINAL.xlsx", firstrow clear

. ///import delimited "D:/Work/QPS/Closed Charts/Monthly working files/Closed Charts Software Outputs/2020/All departments/Q3/OME 
> DETAILS JULY - SEPTEMBER 2020.csv", case(upper)
> 
. drop if MET == "NA"
(10,494 observations deleted)

. keep if DEPT == "DOA"
(6,459 observations deleted)

. 
. destring SNN, replace
SNN has all characters numeric; replaced as double

. keep if (SNN == 1.3 | SNN == 4.1 | SNN == 4.2 | SNN == 5.1 | SNN == 5.2 | SNN == 5.3 | SNN == 5.5 | SNN == 7.2)
(3 observations deleted)

. 
. ////Departmental Results
> //Overall percentages
. tab DOCUMENTED

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |        694      100.00      100.00
------------+-----------------------------------
      Total |        694      100.00

. tab TIMELY if DOCUMENTED == "D"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         20        2.88        2.88
          Y |        674       97.12      100.00
------------+-----------------------------------
      Total |        694      100.00

. tab LEGIBLE if DOCUMENTED == "D"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         59        8.50        8.50
          Y |        635       91.50      100.00
------------+-----------------------------------
      Total |        694      100.00

. tab COMPLETE if DOCUMENTED == "D"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         27        3.89        3.89
          Y |        667       96.11      100.00
------------+-----------------------------------
      Total |        694      100.00

. tab MET

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |        598       86.17       86.17
         NM |         96       13.83      100.00
------------+-----------------------------------
      Total |        694      100.00

. 
. //Percentages per document for each Statistic
. tab DOCUMENTS DOCUMENTED, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      | DOCUMENTED
            DOCUMENTS |         D |     Total
----------------------+-----------+----------
Check Consent forms.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Daily CPOE orders a.. |        18 |        18 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Informed Consent Fo.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Intraoperative Note.. |       112 |       112 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Post Anesthesia Rec.. |       112 |       112 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Pre-Operative (Anae.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Pre-Operative Anest.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       694 |       694 
                      |    100.00 |    100.00 


. tab DOCUMENTS TIMELY if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        TIMELY
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         0         18 |        18 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         3        110 |       113 
                      |      2.65      97.35 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |         1        111 |       112 
                      |      0.89      99.11 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        15         97 |       112 
                      |     13.39      86.61 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |         1        112 |       113 
                      |      0.88      99.12 |    100.00 
----------------------+----------------------+----------
                Total |        20        674 |       694 
                      |      2.88      97.12 |    100.00 


. tab DOCUMENTS LEGIBLE if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         0         18 |        18 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         3        110 |       113 
                      |      2.65      97.35 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |        13         99 |       112 
                      |     11.61      88.39 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        15         97 |       112 
                      |     13.39      86.61 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        24         89 |       113 
                      |     21.24      78.76 |    100.00 
----------------------+----------------------+----------
                Total |        59        635 |       694 
                      |      8.50      91.50 |    100.00 


. tab DOCUMENTS COMPLETE if DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |       COMPLETE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |         1         17 |        18 
                      |      5.56      94.44 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         1        112 |       113 
                      |      0.88      99.12 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |         0        112 |       112 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        10        102 |       112 
                      |      8.93      91.07 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         5        108 |       113 
                      |      4.42      95.58 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        10        103 |       113 
                      |      8.85      91.15 |    100.00 
----------------------+----------------------+----------
                Total |        27        667 |       694 
                      |      3.89      96.11 |    100.00 


. tab DOCUMENTS MET, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
            DOCUMENTS |         M         NM |     Total
----------------------+----------------------+----------
Check Consent forms.. |       111          2 |       113 
                      |     98.23       1.77 |    100.00 
----------------------+----------------------+----------
Daily CPOE orders a.. |        17          1 |        18 
                      |     94.44       5.56 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |       106          7 |       113 
                      |     93.81       6.19 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |        98         14 |       112 
                      |     87.50      12.50 |    100.00 
----------------------+----------------------+----------
Post Anesthesia Rec.. |        79         33 |       112 
                      |     70.54      29.46 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |       106          7 |       113 
                      |     93.81       6.19 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        81         32 |       113 
                      |     71.68      28.32 |    100.00 
----------------------+----------------------+----------
                Total |       598         96 |       694 
                      |     86.17      13.83 |    100.00 


. 
. 
. 
. ////Group summaries
> ///Physicians
> //Overall
. tab DOCUMENTED if TYPE == "P"

 DOCUMENTED |      Freq.     Percent        Cum.
------------+-----------------------------------
          D |        564      100.00      100.00
------------+-----------------------------------
      Total |        564      100.00

. tab TIMELY if TYPE == "P" & DOCUMENTED == "D"

     TIMELY |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |          5        0.89        0.89
          Y |        559       99.11      100.00
------------+-----------------------------------
      Total |        564      100.00

. tab LEGIBLE if TYPE == "P" & DOCUMENTED == "D"

    LEGIBLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         44        7.80        7.80
          Y |        520       92.20      100.00
------------+-----------------------------------
      Total |        564      100.00

. tab COMPLETE if TYPE == "P" & DOCUMENTED == "D"

   COMPLETE |      Freq.     Percent        Cum.
------------+-----------------------------------
          N |         16        2.84        2.84
          Y |        548       97.16      100.00
------------+-----------------------------------
      Total |        564      100.00

. tab MET if TYPE == "P"

        MET |      Freq.     Percent        Cum.
------------+-----------------------------------
          M |        502       89.01       89.01
         NM |         62       10.99      100.00
------------+-----------------------------------
      Total |        564      100.00

. 
. //Physician documents
. tab DOCUMENTS DOCUMENTED if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      | DOCUMENTED
            DOCUMENTS |         D |     Total
----------------------+-----------+----------
Check Consent forms.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Informed Consent Fo.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Intraoperative Note.. |       112 |       112 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Pre-Operative (Anae.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
Pre-Operative Anest.. |       113 |       113 
                      |    100.00 |    100.00 
----------------------+-----------+----------
                Total |       564 |       564 
                      |    100.00 |    100.00 


. tab DOCUMENTS TIMELY if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        TIMELY
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         3        110 |       113 
                      |      2.65      97.35 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |         1        111 |       112 
                      |      0.89      99.11 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |         1        112 |       113 
                      |      0.88      99.12 |    100.00 
----------------------+----------------------+----------
                Total |         5        559 |       564 
                      |      0.89      99.11 |    100.00 


. tab DOCUMENTS LEGIBLE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        LEGIBLE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         3        110 |       113 
                      |      2.65      97.35 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |        13         99 |       112 
                      |     11.61      88.39 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         2        111 |       113 
                      |      1.77      98.23 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        24         89 |       113 
                      |     21.24      78.76 |    100.00 
----------------------+----------------------+----------
                Total |        44        520 |       564 
                      |      7.80      92.20 |    100.00 


. tab DOCUMENTS COMPLETE if TYPE == "P" & DOCUMENTED == "D", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |       COMPLETE
            DOCUMENTS |         N          Y |     Total
----------------------+----------------------+----------
Check Consent forms.. |         0        113 |       113 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |         1        112 |       113 
                      |      0.88      99.12 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |         0        112 |       112 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |         5        108 |       113 
                      |      4.42      95.58 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        10        103 |       113 
                      |      8.85      91.15 |    100.00 
----------------------+----------------------+----------
                Total |        16        548 |       564 
                      |      2.84      97.16 |    100.00 


. tab DOCUMENTS MET if TYPE == "P", row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |          MET
            DOCUMENTS |         M         NM |     Total
----------------------+----------------------+----------
Check Consent forms.. |       111          2 |       113 
                      |     98.23       1.77 |    100.00 
----------------------+----------------------+----------
Informed Consent Fo.. |       106          7 |       113 
                      |     93.81       6.19 |    100.00 
----------------------+----------------------+----------
Intraoperative Note.. |        98         14 |       112 
                      |     87.50      12.50 |    100.00 
----------------------+----------------------+----------
Pre-Operative (Anae.. |       106          7 |       113 
                      |     93.81       6.19 |    100.00 
----------------------+----------------------+----------
Pre-Operative Anest.. |        81         32 |       113 
                      |     71.68      28.32 |    100.00 
----------------------+----------------------+----------
                Total |       502         62 |       564 
                      |     89.01      10.99 |    100.00 

--Break--
r(1);

end of do-file

--Break--
r(1);

. list if DOCTOR == "Raymond"

     +---------------------------------------------------------------------------------------------------------------------------+
353. |      AKNO |        PATIENTNAMES | ADMNO |              ADMDATE |            DISCHDATE |   DOC_CODE |  DOCTOR | DEPT | SN  |
     | 159-36-09 | LUCY RICHARD KIMARO | 71844 | 8/1/2020 12:00:00 AM | 8/3/2020 12:00:00 AM | ANA 2020-1 | Raymond |  DOA |  5  |
     |---------------------------------------------------------------------------------------+-----------------------------+-----|
     |    SECTION | SNN |                                        DOCUMENTS | TYPE | DOCUME~D | TIMELY | LEGIBLE | COMPLETE | MET |
     |    Consent | 5.1 | Pre-Operative (Anaesthesia) Induction Assessment |    P |        D |      Y |       Y |        N |  NM |
     +---------------------------------------------------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------------------------------------------------+
354. |      AKNO |        PATIENTNAMES | ADMNO |              ADMDATE |            DISCHDATE |   DOC_CODE |  DOCTOR | DEPT | SN  |
     | 159-36-09 | LUCY RICHARD KIMARO | 71844 | 8/1/2020 12:00:00 AM | 8/3/2020 12:00:00 AM | ANA 2020-1 | Raymond |  DOA |  5  |
     |---------------------------------------------------------------------------------------+-----------------------------+-----|
     |    SECTION | SNN |                                        DOCUMENTS | TYPE | DOCUME~D | TIMELY | LEGIBLE | COMPLETE | MET |
     |    Consent | 5.3 |                    Post Anesthesia Recovery Form |    N |        D |      Y |       Y |        Y |   M |
     +---------------------------------------------------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------------------------------------------------+
355. |      AKNO |        PATIENTNAMES | ADMNO |              ADMDATE |            DISCHDATE |   DOC_CODE |  DOCTOR | DEPT | SN  |
     | 159-36-09 | LUCY RICHARD KIMARO | 71844 | 8/1/2020 12:00:00 AM | 8/3/2020 12:00:00 AM | ANA 2020-1 | Raymond |  DOA |  7  |
     |---------------------------------------------------------------------------------------+-----------------------------+-----|
     |    SECTION | SNN |                                        DOCUMENTS | TYPE | DOCUME~D | TIMELY | LEGIBLE | COMPLETE | MET |
     | Procedures | 7.2 |               Intraoperative Notes of Anesthesia |    P |        D |      Y |       Y |        Y |   M |
     +---------------------------------------------------------------------------------------------------------------------------+

. 

. clear

. exit, clear
